#+title: Query class
#+author: Matija
#+email: obidm@gmx.com
#+PROPERTY: header-args:php :session *php*
#+PROPERTY: header-args :results output


**** Devel
     
     #+name: Model example
     #+BEGIN_SRC php
       class Model {
           public function tableName() {
               return 'ime_tabele';
           }
           public function primary() {
               return 'ID_ime_tabele';
           }
       }
     #+END_SRC

     #+RESULTS: Model
     : // NULL

     #+name: Query with sources
     #+BEGIN_SRC php 
       class Query {
           private $components = [];   // Unused...
           private $bindings = [];
           private $sources = [
               'table or alias' => 'source info',
               'alias' => 'table_name',
               'table_name2' => 'table_name2',
               // 'g' => new Source('groups', 'g')
           ];
           private $select = [
               'name' => 'whatever(*)',
               'count' => new Column(),
               'xxx' => new Raw()
           ];
       }
     #+END_SRC

     #+RESULTS: Query
     : [8]     *> [8]     *> [8]     *> [8]     *>

     
     #+name: Source
     #+BEGIN_SRC php :exports code
              abstract class Source {
                  private $name;

                  public function __construct($name) {
                      $this->name = $name;
                  }

                  public function name() {
                      return $this->name;
                  }

                  abstract public function primary();
                  abstract public function table();

                  public function debug() {
                      echo "Table: `" . $this->name() . "` primary: `" . $this->primary() . "`\n";
                  }
              }
     #+END_SRC

     #+RESULTS: Source
     : PHP Fatal error:  Cannot redeclare class Source in /home/matija/Documents/code/php/boris/lib/Boris/EvalWorker.php(152) : eval()'d code on line 1

     #+name: TableSource
     #+BEGIN_SRC php 
       class TableSource extends Source {
           private $table;

           public function __construct($table, $name = null) {
               parent::__construct($name ?: $table);
               $this->table = $table;
           }

           public function primary() {
               return 'id';
           }

           public function table() {
               return $table;
           }
       }
     #+END_SRC

     #+RESULTS: TableSource
     : // NULL

       
     #+name: ModelSource
     #+BEGIN_SRC php 
       class ModelSource extends TableSource {
           private $model;

           public function __construct($model, $name = null) {
               $this->setModel($model);
               parent::__construct($model::tableName(), $name);
           }

           private function setModel($model) {
               // if (class_exists($model) and is_subclass_of($model, QueryObject::class)) {
               if (class_exists($model)) {
                   $this->model = $model;
               } else {
                   throw new Exception("Wrong class name '$model'"); // Should be QueryException
               }
           }

           public function primary() {
               $m =  $this->model;
               return $m::primary();
           }

           public function table() {
               $m = $this->model;
               return $m::tableName();
           }
       };
     #+END_SRC

     #+RESULTS: ModelSource
     : PHP Fatal error:  Cannot redeclare class ModelSource in /home/matija/Documents/code/php/boris/lib/Boris/EvalWorker.php(152) : eval()'d code on line 27


     #+name: Usage
     #+BEGIN_SRC php :exports both
       $s1 = new ModelSource(Model::class);
       $s2 = new ModelSource(Model::class, 'alias');
       $s3 = new TableSource('tabela', 'alias');
       echo "\n";
       $s1->debug();
       $s2->debug();
       $s3->debug();
     #+END_SRC

     #+RESULTS: Usage
     : Table: `ime_tabele` primary: `ID_ime_tabele`
     : Table: `alias` primary: `ID_ime_tabele`
     : Table: `alias` primary: `id`



